''' порядок определяет иерархию
    "_" - соеденитель иерархии

'''

db = {
    'теорема': ['теорема_пифагора'],
    # 'теорема_пифагора': ['текст', 'формула', '1_закономерность'],
    'теорема_пифагора': ['1_закономерность', 'теорема_пифагора_текст', 'теорема_пифагора_формула'],
    'теорема_пифагора_текст': "в прямоугольном треугольнике квадрат длины гипотенузы равен сумме квадратов длин катетов",
    'теорема_пифагора_формула': 'a² + b² = c²',

    'закономерность': ['1_закономерность'],
    '1_закономерность' : 'Если стороны треугольника относятся как 3 : 4 : 5, то такой треугольник прямоугольный',

}

a = {'t': 'Закономерность',
    'b': 'Если стороны треугольника относятся как 3 : 4 : 5, то такой треугольник прямоугольный',
    'from': 'None',
    'to': 'теорема_пифагора'}


    "Формула Евклида"

''' a = m² − n²; b = 2mn; c = m² + n² '''
